In [2]:
import pandas as pd

d1 = {"Name": ["Pankaj", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

df

     Name  ID    Role
0  Pankaj   1     CEO
1    Lisa   2  Editor
2   David   3  Author

## Melt

In [8]:
df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"])

print(df_melted)

  variable   value
0     Name  Pankaj
1     Name    Lisa
2     Name   David
3     Role     CEO
4     Role  Editor
5     Role  Author

In [4]:
df_melted = pd.melt(df, id_vars=["ID", "Name"], value_vars=["Role"])
print(df_melted)

   ID    Name variable   value
0   1  Pankaj     Role     CEO
1   2    Lisa     Role  Editor
2   3   David     Role  Author

## Pivot

In [5]:
import pandas as pd

d1 = {"Name": ["Pankaj", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

df

     Name  ID    Role
0  Pankaj   1     CEO
1    Lisa   2  Editor
2   David   3  Author

In [6]:
df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"], var_name="Attribute", value_name="Value")

df_melted

   ID Attribute   Value
0   1      Name  Pankaj
1   2      Name    Lisa
2   3      Name   David
3   1      Role     CEO
4   2      Role  Editor
5   3      Role  Author

In [7]:

df_unmelted = df_melted.pivot(index='ID', columns='Attribute')

df_unmelted

            Value
Attribute    Name    Role
ID
1          Pankaj     CEO
2            Lisa  Editor
3           David  Author

## Assignments

In [9]:
df = pd.DataFrame({
  "Accessories": ["Laptop", "Laptop", "Ipad", "Ipad", "Tablet", "Laptop"],
  "customer": ["Andrew", "Andrew", "Tom", "Andrew", "Tobey", "Peter"],
  "quantity": [1, 2, 2, 3, 1, 2],
})
df

  Accessories customer  quantity
0      Laptop   Andrew         1
1      Laptop   Andrew         2
2        Ipad      Tom         2
3        Ipad   Andrew         3
4      Tablet    Tobey         1
5      Laptop    Peter         2

In [14]:
df.groupby(['Accessories', 'customer']).quantity.sum()

Accessories  customer
Ipad         Andrew      3
             Tom         2
Laptop       Andrew      3
             Peter       2
Tablet       Tobey       1
Name: quantity, dtype: int64

In [15]:
df = pd.DataFrame({
 "A":['tst1','tst2','tst3','tst3'],
 "B":[5, 6, 7, 8],
 "C":[9, 10, 11 ,12],
 "D":[13, 14, 15, 16]
})
df

      A  B   C   D
0  tst1  5   9  13
1  tst2  6  10  14
2  tst3  7  11  15
3  tst3  8  12  16

In [27]:
import numpy as np
df.melt(id_vars =['A' ], value_vars =  np.array(df.columns),var_name ='St_name', value_name ='Scores')

       A St_name  Scores
0   tst1       B       5
1   tst2       B       6
2   tst3       B       7
3   tst3       B       8
4   tst1       C       9
5   tst2       C      10
6   tst3       C      11
7   tst3       C      12
8   tst1       D      13
9   tst2       D      14
10  tst3       D      15
11  tst3       D      16

In [24]:
np.array(df.columns)

array(['A', 'B', 'C', 'D'], dtype=object)

In [25]:
 np.array(df.columns)[1:]

array(['B', 'C', 'D'], dtype=object)